//给定一个非负整数 num。对于 0 ≤ i ≤ num 范围中的每个数字 i ，计算其二进制数中的 1 的数目并将它们作为数组返回。 
//
// 示例 1: 
//
// 输入: 2
//输出: [0,1,1] 
//
// 示例 2: 
//
// 输入: 5
//输出: [0,1,1,2,1,2] 
//
// 进阶: 
//
// 
// 给出时间复杂度为O(n*sizeof(integer))的解答非常容易。但你可以在线性时间O(n)内用一趟扫描做到吗？ 
// 要求算法的空间复杂度为O(n)。 
// 你能进一步完善解法吗？要求在C++或任何其他语言中不使用任何内置函数（如 C++ 中的 __builtin_popcount）来执行此操作。 
// 
// Related Topics 位运算 动态规划 
// 👍 500 👎 0


//leetcode submit region begin(Prohibit modification and deletion)
//1. 分别统计位1 个数
/*
* 通过i&(i-1)消除最低位，剩余的数同样小于当前的i且已被计算过
* */
class Solution {
    public int[] countBits(int num) {
        int[] res = new int[num + 1];
        for (int i = 1; i <= num; ++i)
            res[i] = res[i & (i - 1)] + 1;
        return res;
    }
}
//Round1 位运算 & DP
/*
* 偶数 可以由前面某个数左移得到， 1的个数不变
*   dp[i]=dp[i/2]
*  e.g. 2 -> 10  4->100
*  奇数 可以由前面某个数左移，再加一得到，1的个数+1
*  dp[i] = dp[i-k]+1  k 就是不大于n的2的整数次幂中的最大值
*  e.g.
*
* */
class Solution {
    public int[] countBits(int num) {
        int[] res = new int[num + 1];
        for (int i = 1; i <= num; ++i)
            res[i] = res[i >> 1] + (i & 1); // x / 2 is x >> 1 and x % 2 is x & 1 位运算写法更快
        return res;
    }
}
//leetcode submit region end(Prohibit modification and deletion)
